/*********************************************************************************************************************
* @file            car_init.h
* @author          
* @Target core     GD32F303RCT6
* @revisions       2022.09.19, V1.0
* @modify          none
********************************************************************************************************************/

#ifndef __CAR_INIT_H
#define __CAR_INIT_H

#include "headfile.h"

//宏定义


//函数声明
/* 智能车初始化 */
void car_init(void);
/* 中断初始化 */
void int_init(void);


//全局变量声明

#endif
