/*********************************************************************************************************************
* @file            hf_i2c_software.c
* @author          
* @Target core     GD32F3O3RCT6
* @revisions       2022.9.7 , V1.0
* @modify          none
********************************************************************************************************************/

#include "hf_i2c_software.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief        模拟I2C延时 时间设置
// @param        time            延时时间
// @return       void
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_delay(uint16_t time)
{
    while(time--)
    {
        ;
    }
}

//-------------------------------------------------------------------------------------------------------------------
// @brief      模拟I2C开始信号
// @return     void
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_start(void)//SCL为高电平情况下，SDA由高电平变为低电平
{
    /* 拉高时钟线 */
    SCL_Set();
	
    /* 拉高数据线 */
    SDA_Set();
    i2c_sim_delay(5);
	
    /* 拉低数据线 */
    SDA_Clr();
    i2c_sim_delay(5);
	
    /* 钳住I2C总线，准备发送或接收数据 */
    SCL_Clr();
    i2c_sim_delay(5);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief      模拟I2C终止信号
// @return     void
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_stop(void)//SCL为高电平情况下，SDA由低电平变为高电平
{
    /* 拉低时钟线 */
    SCL_Clr();
	
    /* 拉低数据线 */
    SDA_Clr();
    i2c_sim_delay(5);
	
    /* 拉高时钟线 */
    SCL_Set();
	
    /* 拉高数据线 */
    SDA_Set();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief      模拟I2C等待应答信号
// @return     void
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_waitack(void)//测数据信号的电平
{
    /* 拉低时钟线 */
    SCL_Clr();
    SDA_Clr();
    i2c_sim_delay(5);
	
    /* 拉高时钟线 */
    SCL_Set();
    i2c_sim_delay(5);
    SCL_Clr();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief      模拟I2C应答信号
// @return     void
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_ack(void)
{
    /* 拉低时钟线 */
    SCL_Clr();
	
    /* 拉低数据线 */
    SDA_Clr();
    i2c_sim_delay(5);
	
    /* 拉高时钟线 */
    SCL_Set();
    i2c_sim_delay(5);
	
    /* 拉低时钟线 */
    SCL_Clr();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief      模拟I2C非应答信号
// @return     void
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_nack(void)
{
    /* 拉低时钟线 */
    SCL_Clr();
	
    /* 拉高数据线 */
    SDA_Set();
    i2c_sim_delay(5);
	
    /* 拉高时钟线 */
    SCL_Set();
    i2c_sim_delay(5);
	
    /* 拉低时钟线 */
    SCL_Clr();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief      模拟I2C发送单字节
// @return     void
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_send_byte(uint8_t data)
{
    uint8_t i;
	
    for(i=0; i<8; i++)
    {
        if(data>>7)
        {
            /* 拉高数据线 */
            SDA_Set();
        }
        else 
        {
            /* 拉低数据线 */
            SDA_Clr();
        }

        data <<= 1;
        i2c_sim_delay(5);
								
        /* 拉高时钟线 */
        SCL_Set();
        i2c_sim_delay(5);
								
        /* 拉低时钟线 */
        SCL_Clr();
    }
				
    /* IIC等待应答信号 */
    i2c_sim_waitack();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief      模拟I2C读取单字节
// @return     uint8_t
// Sample usage:        如果IIC通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
uint8_t i2c_sim_read_byte(void)
{
    uint8_t i,recv;
    recv = 0;
	
    /* 拉低时钟线 */
    SCL_Clr();
    i2c_sim_delay(5);
	
    /* 拉高数据线 */
    SDA_Set();

    for(i=0; i<8; i++)
    {
        /* 拉低时钟线 */
        SCL_Clr();
        i2c_sim_delay(5);
					
        /* 拉高时钟线 */
        SCL_Set();
        i2c_sim_delay(5);
        recv <<= 1;
        if(SDA_Get() == 1)
        {
            recv++;
        }
        i2c_sim_delay(5);
    }

    /* 拉低时钟线 */
    SCL_Clr();
    i2c_sim_delay(5);
    return recv;
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        模拟I2C向寄存器写入单字节
// @param        addr            外设从机地址
// @param        reg             外设寄存器
// @param        dat             数据
// @return       void
// Sample usage:        wr_reg(0x78, 0x21, 0x30)
//              向从机地址为0x78的外设的0x21寄存器写入数据0x30
//                  如果I2C通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_write_reg_byte(uint8_t addr, uint8_t reg, uint8_t dat)
{
    i2c_sim_start();
    i2c_sim_send_byte((addr<<1) | 0x00);
    i2c_sim_send_byte(reg);
    i2c_sim_send_byte(dat);
    i2c_sim_stop();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        模拟I2C向寄存器写入多字节数据
// @param        addr            外设从机地址
// @param        reg             外设寄存器
// @param        *dat            数据首地址
// @param        length          数据长度
// @return       void
// Sample usage:        wr_reg(0x78, 0x21, str, 5)
//              向从机地址为0x78的外设的0x21寄存器写入5个字节的数据
//                  如果I2C通讯失败可以尝试增加i2c_sim_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_write_reg_bytes(uint8_t addr, uint8_t reg, uint8_t *dat, uint8_t length)
{
    i2c_sim_start();
    i2c_sim_send_byte((addr<<1) | 0x00);
    i2c_sim_send_byte(reg);

    while(length)
    {
        i2c_sim_send_byte(*dat++);       //内部寄存器数据
        length--;
    }

    i2c_sim_stop();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        模拟I2C从寄存器读取多字节
// @param        addr            外设从机地址
// @param        reg             外设寄存器
// @param        *dat            数据首地址
// @param        length          数据长度
// @return       void
// Sample usage:        rd_reg(0x78, 0x21, str, 5);
//                从从机地址为0x78的外设的0x21寄存器读取5个字节的数据，存放在dat指向的地址中
//                 如果I2C通讯失败可以尝试增加i2c_delay的值
//-------------------------------------------------------------------------------------------------------------------
void i2c_sim_read_reg_bytes(uint8_t addr, uint8_t reg, uint8_t *dat, uint8_t length)
{
    i2c_sim_start();
    i2c_sim_send_byte((addr<<1) | 0x00);
    i2c_sim_send_byte(reg);
    i2c_sim_start();
    i2c_sim_send_byte((addr<<1) | 0x01);

    while(length-1)
    {
        *dat ++= i2c_sim_read_byte();
        i2c_sim_ack();
        length--;
    }

    *dat = i2c_sim_read_byte();
    i2c_sim_ack();
    i2c_sim_stop();
}
